import React from "react";


class Content extends React.Component {
    render() {
        return <div>
            <h3>
                Дата та місце народження:
            </h3>
            <p> 2 січня 2002 року, Волинська область, місто Нововолинськ </p>
            <h3>Освіта: </h3>
            <p>Нововолинський ліцей №5, 2008-2016рр.</p>
            <p>Нововолинський ліцей №2, 2016-2019рр.</p>
            <p id="sevenEl" onMouseDown={this.ChangeColor}>
                Національний технічний університет України
                "Київський політехнічний інститут
                імені Ігоря Сікорського", 2019-2023рр.
            </p>
            <h3 id="nextEl" onMouseDown={this.ChangeColor}>Мої хобі</h3>
            <ul>
                <li>Танці</li>
                <li>Книги</li>
                <li>Настільні ігри</li>
                <li>Пішохідний туризм</li>
            </ul>
            <h3>Улюблені книги</h3>
            <ol>
                <li>"Сад Гетсиманський" Іван Багряний</li>
                <li>"Зазирни у мої сни", Макс Кідрук</li>
                <li>"Дівчина, яку ми вбили", Кулакова Поліна</li>
            </ol>
            <h3>Ніцца</h3>
            <p>Ніцца (фр. Nice, італ. Nizza, лат. Nicaea) – місто на південному сході Франції в регіоні Прованс — Альпи —
                Лазурний Берег. Це найвідоміший курорт французького Середземномор’я і великий порт. Ніцца — мальовниче місто,
                наповнене сонцем і чудовими морськими пейзажами, яке є ідеальним місцем для вивчення Лазурного берега. Це місто
                з італійським темпераментом і енергійною середземноморською атмосферою, буквально створений для відпочинку та
                насолоди життям. Ніцца — це чарівні старі вулички та чудові променади, красива архітектура і чудові музеї,
                гламурне нічне життя і розкішні готелі.
            </p>
        </div>;
    }

    ChangeColor(event){
        let el = event.target;
        if (el.classList.contains('SetColor')) {
            el.classList.remove('SetColor')
        } else{
            el.className = 'SetColor';
        }
    };
}

export default Content